#### 28/02/2025
bash
1. Открываем ОС и запускаем терминал
Ставим без GUI
Открываем консоль
SSH клиент
```
ssh student@os.noc-simplex.ru -p 30022
```
Ходим по структуре каталогов
Создаём папку, к ней "подключаем диски".
Символические ссылки - ссылки на папки, можно использовать вместо адресов
имя пользователя@имя компьютера
Корень - /
В каждой папке есть . и ..
. - символическая ссылку на эту папку
.. - папка, в которой находится эта папка.
Базовый набор команд:
1. ls
[Директория_name] 
[-a]  - скрытые файлы
[-l] - показывает атрибуты
2. cd
3. pwd - если потерялся
4. whoami - например, для использования программой
5. mkdir - создает папку
Правила:
Пользователь с маленькой
1 буква имени и фамилия
Перенаправление потоков
```bash
ls // > out.txt #- поток вывода в файл
ls // 2> another.txt #- поток ошибок в файл
ls //
```
 cat - просматривает файл
 1. clear
```bash
ls /usr/bin | less  #- q выход
ls /usr/bin -la > out.txt
less < out.txt
```
Сборка программы


Создать файл 
`touch` 
```bash
touch maxim.cpp
```
открываем файл в [neo]vim или nano
```cpp
#include <iosteam>

int main()
{
	std::cout << "Hello world!" << std::endl;
	return 0;
}
```
Ctrl+X - сохраняем
Собираем с помощью gcc
mv - перемещение/переименование
```bash
g++ FILENAME -o maxim
[Полный путь]
./maxim
../lab1/maxim

```
Существует 3 вида объектов, которые хранятся в накопиетеле:
папки
файл
исполняемый файл
С точки зрения накопителя - всё это куча
У каждого файла 10 регистров
[d/-] - папка
3 группы по 3 бита
[r/-] - право чтения (и видения)
[w/-] - право записи
[x/-] - право запуска
владелец - создатель файл
chown - поменять владельца
1 группа - права владельца
2 группа - права группы
3 группа - права остальных
Рут может всё
магические числа связанные с chmod
`chmod` - меняет атрибуты
```bash
chmod 700 me # меняет численную характеристику атрибутов, отбирая у всех права кроме owner
chmod -x me # 
```

Создать программу
Cmake 

Установка програм,
Переключение пользователя

#### 14/03/2025

Входные данные:
google -> boeing sparce matrix -> \*.mtx
200000 на 200000

Метод сопряжённых градиентов (симметричные, + определённые матрицы)

Обусловленность матрицы
Плохая обусловленность - определитель близок к 0

Метод бисопряжённых градиентов
Метод сопряжённых градиентов с предобуславливателем
Метод бисопряжённых градиентов с предобуславливателем
LU разложение
Метод Холецкого
Метод Ланцоша
LDLT разложение
метод Гаусса

Как свести решение этого уравнения к экстремальной задачке?
Ax=b

Создать матрицу для проверки:
1. Создаём симметричную матрицу
2. Положительно определённая ($A\cdot A^T$)
Ax=b
Ax-b~0
$\lVert Ax-b \rVert<\varepsilon$
Если dim >10000 критерий плохо подходит
$$\frac{\lVert Ax-b \rVert}{\lVert b \rVert} <\varepsilon$$
Закон Амдала
$$S_{p}=\frac{1}{\alpha+\frac{1-\alpha}{p}}$$
$$S_{p}=\frac{t_{1}}{t_{p}}$$



| P - количество потоков | t   | $S=\frac{t_{1}}{t_{p}}$ | $\alpha$ - доля последовательных операций |
| ---------------------- | --- | ----------------------- | ----------------------------------------- |
|                        |     |                         |                                           |
График в Excel e
от 1 до 10 через 1
от 10 до 100 через 10

Задачки
у нас 4

Метод бисопряжённых градиентов с предобуславливателем
